// صبح کی دعائیں

// الْحَمْدُ لله وَحْدَهُ ، وَالصَّلَاةُ وَالسَلَامُ عَلَى مَنْ لَا نَبِيَّ بَعْدَهُ

// Alhamdulillahi wahdah, wassalaatu wassalaamu a'laa man la nabiyya ba'adah

// تمام تعریفیں اللہ  کے لئے ہیں جو یکتا ہے،اور درودوسلام اس پر جس کے بعد کوئی نبی نہیں

// أَعُوذُ بِاللهِ مِنَ الشَّيْطَانِ الرَّجِيمِ

// 'A 'oothu billaahi minash-Shaytaanir-rajeem

// اللهُ لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلَا يَئُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ

// Allaahu laa 'ilaaha 'illaa Huwal-Hayyul-Qayyoom, laa ta'khuthuhu sinatun wa laa nawm, lahu maa fis-samaawaati wa maa fil-'ardh, man thai-lathee yashfa'u 'indahu 'illaa bi'ithnih, ya'lamu maa bayna 'aydeehim wa maa khalfahum, wa laa yuheetoona bishay'im-min 'ilmihi 'illaa bimaa shaa'a, wasi'a kursiyyuhus samaawaati wal'ardh, wa laa ya'ooduhu hifdhuhumaa, wa Huwal- 'Aliyyul- 'Adheem.

// اللہ  وہ ذات ہے جس کے سوا کوئی سچامعبود نہیں۔وہ ذندہ جاوید ہمیشہ قائم رہنے والا ہے۔اسے اونگھ آتی ہے نہ نیند۔اسی کا ہے جو کچھ آسمانوں میں ہے اور جو کچھ ذمین میں ہے۔کون ہے وہ جو اسکے ہاں اسکی اجازت کے بغیر (کسی کی)سفارش کرسکے؟ وہ ان چیزوں کو جانتا ہے  جو ان کے سامنے ہیں اور جو انکے پیچھے ہیں۔اوروہ(لوگ)اس کے علم میں سے کسی چیز پر دسترس نہیں  رکھتے تاہم جس قدر وہ خود چاہے۔اس کی کرسی حاوی ہے ۔آسمانوں اورذمین پر اور نہیں گراں گزرتی اسے حفاظت ان دونوں کی اور وہ بلند مرتبہ ہے عظمت والا ہے

// بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ. قُلْ هُوَ اللهُ أَحَدٌ ۞ اللهُ الصَّمَدُ ۞ لَمْ يَلِدْ وَلَمْ يُولَدْ ۞ وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ

// Bismillaahir-Rahmaanir-Raheem. Qul Huwallaahu 'Ahad. Allaahus-Samad. Lam yalid wa lam yoolad. Wa lam yakun lahu kufuwan 'ahad.

// شروع کرتا ہوں اللہ  کے نام سے جو بڑا مہربان نہایت رحم والا ہے۔(آپﷺ)کہہ دیجئیے کہ وہ اللہ  ایک ہے۔ اللہ  بے نیاز ہے۔ اسکی کوئی اولاد ہے اور نہ وہ کسی کی اولاد، اور نہ ہی کوئی اس کا ہم پلہ ہے۔

// بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ.۞ قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ ۞ مِنْ شَرِّ مَا خَلَقَ ۞ وَمِنْ شَرِّ غَاسِقٍ إِذَا وَقَبَ ۞ وَمِنْ شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ ۞ وَمِنْ شَرِّ حَاسِدٍ إِذَا حَسَدَ۞

// Bismillaahir-Rahmaanir-Raheem. Qul 'a'oothu birabbil-falaq. Min sharri ma khalaq. Wa min sharri ghaasiqin 'ithaa waqab. Wa min sharrin-naffaathaati fil-'uqad. Wa min sharri haasidin 'ithaa hasad.

// شروع کرتا ہوں اللہ  کے نام سے جو بڑا مہربان نہایت رحم والا ہے۔(آپﷺ)کہہ دیجئیے کہ میں پناہ چاہتا ہوں صبح کے رب کی، اس چیز کے شر سے جو اس نے پیدا کی اور اندھیرا کرنے والے کے شر سے جب وہ چھپ جائے۔ اور گرہوں میں پھونکنے والیوں کے شر سے اور حسد کرنے والے کے شر سے جب وہ حسد کرے۔

// بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ. قُلْ أَعُوذُ بِرَبِّ النَّاسِ ۞ مَلِكِ النَّاسِ ۞ إِلَهِ النَّاسِ ۞ مِنْ شَرِّ الْوَسْوَاسِ الْخَنَّاسِ ۞ الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ ۞ مِنَ الْجِنَّةِ وَالنَّاسِ

// Bismillaahir-Rahmaanir-Raheem. Qul 'a'oothu birabbin-naas. Malikin-naas. 'Ilaahin-naas. Min sharril-waswaasil-khannaas. Allathee yuwaswisu fee sudoorin-naas. Minal-jinnati wannaas.

// شروع کرتا ہوں اللہ  کے نام سے جو بڑا مہربان نہایت رحم والا ہے۔(آپﷺ)کہہ دیجئیے کہ میں پناہ میں آتا ہوں لوگوں کے رب کی،لوگوں کے بادشاہ کی ،لوگوں کے معبود کی،وسوسہ ڈالنے والے شیطان سے جو آنکھوں سے اوجھل ہے۔ جو وسوسہ ڈالتا ہے لوگوں کے سینوں میں ۔جنوں میں سے اور انسانوں میں سے۔

// أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ للهِ وَالْحَمْدُ للهِ، لَا إِلَهَ إِلَّا اللهُ وَحَدْهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، ربِّ أَسْأَلُكَ خَيْرَ مَا فِي هَذَا الْيَومِ وَخَيْرَ مَا بَعْدَهُ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِي هَذَا الْيَومِ وَشَرِّ مَا بَعْدَهُ، رَبِّ أَعُوذُ بِكَ مِنَ الْكَسَلِ، وَسُوءِ الكِبَرِ، رَبِّ أَعُوذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ وَعَذَابٍ فِي الْقَبْرِ

// 'Asbahnaa wa 'asbahal-mulku lillaahi walhamdu lillaahi, laa 'ilaaha 'illallaahu wahdahu laa shareeka lahu, lahul-mulku wa lahul-hamdu wa Huwa 'alaa kulli shay'in Qadeer. Rabbi 'as'aluka khayra maa fee haathal-yawmi wa khayra maa ba'dahu wa 'a'oothu bika min sharri maa fee haathal-yawmi wa sharri maa ba'dahu, Rabbi 'a'oothu bika minal-kasali, wa soo'il-kibari, Rabbi 'a'oothu bika min 'athaabin fin-naari wa 'athaabin fil-qabri.

// ہم نے اور اللہ  کے ملک نے صبح کی اور ہر قسم کی تعریف اللہ  ہی کے لئے ہے۔ اللہ  کے علاوہ کوئی (سچا)معبود نہیں۔وہ اکیلا ہے اس کا کوئی شریک نہیں۔اسی کی ہی بادشاہت ہے اور اسی کی ہی تعریف ہے اور وہ ہرچیز پر کامل قدرت رکھتا ہے۔اے میرے رب! میں تجھ سے اس دن کی بہتری اور اس کے بعد آنے واوالے دنوں کی بہتری کا سوال کرتا ہوں اور میں تیری پناہ میں آتا ہوں اس دن کے شر سے اور اس کے بعد آنے والے دنوں کے شر سے، اے میرے رب میں کاہلی اور بڑھاپے کی خرابی سے تیری پناہ میں آتا ہوں۔اے میرے رب! میں تیری پناہ میں آتا ہوں آگ کے عذاب سے اور قبر کے عذاب سے

// اللَّهُمَّ بِكَ أَصْبَحْنَا، وَبِكَ أَمْسَيْنَا، وَبِكَ نَحْيَا، وَبِكَ نَمُوتُ وَإِلَيْكَ النُّشُورُ

// Allaahumma bika 'asbahnaa, wa bika 'amsaynaa, wa bika nahyaa, wa bika namootu wa 'ilaykan-nushoor.

// اے اللہ  تیری ہی توفیق سے ہم نے صبح کی اور تیری ہی توفیق سے شام اور تیرے ہی نام پر ہم ذندہ ہیں اور تیرے ہی نام پر ہم مریں گے اور تیری طرف ہی لوٹ کر جانا ہے۔

// اللَّهُمَّ أَنْتَ رَبِّي لَا إِلَهَ إِلَّا أَنْتَ خَلَقْتَنِي وَأَنَا عَبْدُكَ وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ وَأَبُوءُ  بِذَنْبِي فَاغْفِرْ لِي فَإِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ

// Allaahumma 'Anta Rabbee laa 'ilaaha 'illaa 'Anta, khalaqtanee wa 'anaa 'abduka, wa 'anaa 'alaa 'ahdika wa wa'dika mas-tata'tu, 'a'oothu bika min sharri maa sana'tu, 'aboo'u laka bini'matika 'alayya, wa 'aboo'u bithanbee faghfir lee fa'innahu laa yaghfiruth-thunooba 'illaa 'Anta.

// اے اللہ ! تو میرارب ہے،تیرے علاوہ کوئی (سچا)معبود نہیں تو نے مجھے پیدافرمایا اور میں تیرابندہ ہوں۔اور میں اپنی طاقت کے مطابق تیرے عہد اور وعدے پر قائم ہوں۔اپنے کئے کے شر سے تیری پناہ میں آتا ہوں۔میں اپنے اوپر تیرے انعام کا اقرار کرتا ہوں اور میں اپنے گناہ کا اقرار کرتاہوں لہٰذاتو مجھے معاف کردے۔سچی بات یہ ہے کہ تیرے سوا کوئی بھی گناہ معاف نہیں کرسکتا

// اللَّهُمَّ إِنِّي أَصْبَحْتُ أُشْهِدُكَ وَأُشْهِدُ حَمَلَةَ عَرْشِكَ، وَمَلَائِكَتَكَ وَجَمِيعَ خَلْقِكَ، أَنَّكَ أَنْتَ اللهُ لَا إِلَهَ إِلَّا أَنْتَ وَحْدَكَ لَا شَرِيكَ لَكَ، وَأَنَّ مُحَمَّداً عَبْدُكَ وَرَسُولُكَ

// Allaahumma 'innee 'asbahtu 'ush-hiduka wa 'ush-hidu hamalata 'arshika, wa malaa'ikataka wajamee'a khalqika, 'annaka 'Antallaahu laa 'ilaaha 'illaa 'Anta wahdaka laa shareeka laka, wa 'anna Muhammadan 'abduka wa Rasooluka.

// اے اللہ ! یقیناََ میں نے ایسی حالت میں صبح کی کہ تجھے گواہ بناتا ہوں اور تیرا عرش اٹھانے والوں اور تیرے فرشتوں اور تیری تمام مخلوق کو اس اقرار پر گواہ بناتا ہوں کہ تو ہی اللہ  ہے،تیرے سوا کوئی (سچا)معبود نہیں ۔تو اکیلا ہے،تیرا کوئی شریک نہیں۔اور بلاشبہ حضرت محمدﷺ تیرے بندے اور تیرے رسول ہیں



// اللَّهُمَّ مَا أَصْبَحَ بِي مِنْ نِعْمَةٍ أَوْ بِأَحَدٍ مِنْ خَلْقِكَ فَمِنْكَ وَحْدَكَ لَا شَرِيكَ لَكَ، فَلَكَ الْحَمْدُ وَلَكَ الشُّكْرُ

// Allaahumma maa 'asbaha bee min ni'matin 'aw bi'ahadin min khalqika faminka wahdaka laa shareeka laka, falakal-hamdu wa lakash-shukru.

// اے اللہ ! صبح کے وقت مجھ پر یا تیری مخلوق میں سے کسی پر جو بھی انعام ہوا ہے تو وہ تیری ہی طرف سے ہے۔تو اکیلا ہے ،تیرا کوئی شریک نہیں۔لہٰذاتیرے لئے ہی حمد ہے اور تیرے لئے ہی شکر۔

// اللَّهُمَّ عَافِنِي فِي بَدََنِي، اللَّهُمَّ عَافِنِي فِي سَمْعِي، اللَّهُمَّ عَافِنِي فِي بَصَرِي، لَا إِلَهَ إِلَّا أَنْتَ. اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكُفرِ، وَالْفَقْرِ، وَ أَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، لَا إِلَهَ إِلَّا أَنْتَ

// Allaahumma 'aafinee fee badanee, Allaahumma 'aafinee fee sam'ee, Allaahumma 'aafinee fee basaree, laa 'ilaaha 'illaa 'Anta. Allaahumma 'innee 'a'oothu bika minal-kufri, walfaqri, wa 'a'oothu bika min 'athaabil-qabri, laa 'ilaaha 'illaa 'Anta.

// اے اللہ ! مجھے عافیت دے میرے بدن میں۔اے اللہ ! مجھے عافیت دے میرے کانوں میں۔اے اللہ  مجھے عافیت دے میری آنکھوں میں۔تیرے علاوہ کوئی (سچا)معبود نہیں۔اے اللہ !یقیناََمیں تیری پناہ میں آتا ہوں عذابِ قبر سے۔تیرے علاوہ کوئی (سچا)معبود نہیں۔



// حَسْبِيَ اللهُ لَآ إِلَهَ إِلَّا هُوَ عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ

// Hasbiyallaahu laa 'ilaaha 'illaa Huwa 'alayhi tawakkaltu wa Huwa Rabbul-'Arshil-'Adheem

// مجھے اللہ  ہی کافی ہے۔ اس کے علاوہ کوئی (سچا)معبود نہیں۔اسی پر میں نے توکل کیا اور وہ عرشِ عظیم کا رب ہے



// اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ، اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي دِينِي وَدُنْيَايَ وَأَهْلِي، وَمَالِي، اللَّهُمَّ اسْتُرْ عَوْرَاتِي، وَآمِنْ رَوْعَاتِي، اللَّهُمَّ احْفَظْنِي مِنْ بَيْنِ يَدَيَّ، وَمِنْ خَلْفِي، وَعَنْ يَمِينِي، وَعَنْ شِمَالِي، وَمِنْ فَوْقِي، وَأَعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي

// Allaahumma 'innee 'as'alukal-'afwa wal'aafiyata fid-dunyaa wal'aakhirati, Allaahumma 'innee 'as'alukal-'afwa wal'aafiyata fee deenee wa dunyaaya wa 'ahlee, wa maalee , Allaahum-mastur 'awraatee, wa 'aamin raw'aatee, Allaahum-mahfadhnee min bayni yadayya, wa min khalfee, wa 'an yameenee, wa 'an shimaalee, wa min fawqee, wa 'a'oothu bi'adhamatika 'an 'ughtaala min tahtee.

// اے اللہ ! بیشک میں آپ سے دنیا و آخرت میں معافی اور عافیت کی درخواست کرتا ہوں۔ اے اللہ !بیشک میں آپ سے معافی اور عافیت کی درخواست کرتا ہوں اپنے دین اور دنیا اور اپنے اہل و مال میں۔ اے اللہ ! میری پردے والی باتوں پر پردہ ڈال اور میرے خوف وہراس کو (امن میں)بدل دے۔ اے اللہ !تو میری حفاظت فرما میرے سامنے سے، میرے پیچھے سے ، میری دائیں طرف سے اور میری بائیں طرف سے اور میرے اوپر سے ۔ اور میں تیری عظمت کی پناہ چاہتاہوں اِس بات سے کہ ناگہاں اپنے نیچے سے ہلاک کیاجاؤں

// اللَّهُمَّ عَالِمَ الْغَيْبِ وَالشَّهَادَةِ فَاطِرَ السَّماوَاتِ وَالْأَرْضِ، رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي، وَمِنْ شَرِّ الشَّيْطَانِ وَشِرْكِهِ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءاً، أَوْ أَجُرَّهُ إِلَى مُسْلِمٍ

// Allaahumma 'Aalimal-ghaybi wash-shahaadati faatiras-samaawaati wal'ardhi, Rabba kulli shay 'in wa maleekahu, 'ash-hadu 'an laa 'ilaaha 'illaa 'Anta, 'a'oothu bika min sharri nafsee, wa min sharrish-shaytaani wa shirkihi, wa 'an 'aqtarifa 'alaa nafsee soo'an, 'aw 'ajurrahu 'ilaa Muslimin.

// اے اللہ ! غیب اور حاضر کے جاننے والے ! آسمانوں اور زمین کے پیدا کرنے والے، ہر چیز کے رب اور مالک ! میں گواہی دیتا ہوں کہ تیرے سوا کوئ معبود نہیں۔ میں تیری پناہ میں آتا ہوں اپنے نفس کے شر سے ، شیطان کے شر سے ، اس کی شرک سے اور اس بات سے کہ اپنے ہی خلاف کسی برائی کا ارتکاب کروں یا اسے کسی مسلمان کی طرف کھینچ لاؤں۔

// بِسْمِ اللهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ

// Bismillaahil-lathee laa yadhurru ma'as-mihi shay'un fil-'ardhi wa laa fis-samaa'i wa Huwas-Samee 'ul- 'Aleem .

// اس اللہ  کے نام کے ساتھ جس کے نام کے ہوتے ہوئے کوئی چیز نقصان نہیں پہنچا سکتی، ذمین کی ہو یا آسمانوں کی ۔ وہ خوب سننے والا، خوب جاننے والا ہے

// رَضِيتُ باللهِ رَبَّاً، وَبِالْإِسْلَامِ دِيناً، وَبِمُحَمَّدٍ صَلَى اللهُ عَلِيهِ وَسَلَّمَ نَبِيَّاً

// Radheetu billaahi Rabban, wa bil-'Islaami deenan, wa bi-Muhammadin (sallallaahu 'alayhi wa sallama) Nabiyyan.

// میں راضی ہوا اللہ  کے رب ہونے پر، اسلام کے دین ہونے پر اور محمد ﷺ کے نبی ہونے پر



// يَا حَيُّ يَا قَيُّومُ بِرَحْمَتِكَ أَسْتَغِيثُ أَصْلِحْ لِي شَأْنِي كُلَّهُ وَلَا تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ

// Yaa Hayyu yaa Qayyoomu birahmatika 'astagheethu 'aslih lee sha'nee kullahu wa laa takilnee 'ilaa nafsee tarfata 'aynin.

// اے ذندہ جاوید! اے قائم ودائم میں تیری ہی رحمت کے ذریعے فریاد کرتا ہوں تو میرا ہر کام سنوار دے، اور مجھے آنکھ جھپکنے کے برابر بھی میرے اپنے سپرد نہ کر

// أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلہ رَبِّ الْعَالَمِينَ، اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَ هَذَا الْيَوْمِ: فَتْحَهُ، وَنَصْرَهُ وَنُورَهُ، وَبَرَكَتَهُ، وَهُدَاهُ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِيهِ وَشَرِّ مَا بَعْدَهُ

// 'Asbahnaa wa 'asbahal-mulku lillaahi Rabbil-'aalameen, Allaahumma 'innee 'as'aluka khayra haathal-yawmi: Fathahu wa nasrahu wa noorahu, wa barakatahu, wa hudaahu, wa'a'oothu bika min sharri maafeehi wa sharri maa ba'dahu.

// ہم نے اور اللہ  ربِ کائنات کے ملک نے صبح کی۔ اے اللہ !میں آپ سے مانگتا ہوں اس دن کی بہتری،اس کی فتح ونصرت، اس کا نور اور اس کی برکت اور ہدایت۔ اور میں آپ کی پناہ چاہتا ہوں اس دن کے شر سے اور اس کے بعد والے دنوں کے شر سے

// أَصْبَحْنَا عَلَى فِطْرَةِ الْإِسْلَامِ وَعَلَى كَلِمَةِ الْإِخْلَاصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَى اللهُ عَلِيهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إِبْرَاهِيمَ، حَنِيفَاً مُسْلِماً وَمَا كَانَ مِنَ الْمُشْرِكِينَ

// 'Asbahnaa 'alaa fitratil-'Islaami wa 'alaa kalimatil-'ikhlaasi, wa 'alaa deeni Nabiyyinaa Muhammadin (sallallaahu 'alayhi wa sallama), wa 'alaa millati 'abeenaa 'Ibraaheema, haneefan Musliman wa maa kaana minal-mushrikeen.

// ہم نے صبح کی فطرتِ اسلام پر کملۂ اخلاص پر،اپنے نبی حضرت محمد ﷺ کے دین پر اور اپنے باپ حضرت ابرہیم علیہ السلام کی ملت پر جو یک رخ (اور)فرمانبردار تھے اور وہ ہرگز مشرکوں میں سے نہیں تھے

// سُبْحَانَ اللهِ وَبِحَمْدِهِ

// Subhaanallaahi wa bihamdihi.

// میں اللہ  کی تعریف کے ساتھ ساتھ اس کی پاکیزگی بیان کرتاہوں



// لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ

// Laa 'ilaaha 'illallaahu wahdahu laa shareeka lahu, lahul-mulku wa lahul-hamdu, wa Huwa 'alaa kulli shay'in Qadeer.

// اللہ  تعالیٰ کے علاوہ کوئی (سچا)معبود نہیں،وہ اکیلا ہے، اس کا کوئی شریک نہیں اسی کی بادشاہت اور اسی کی تعریف ہے۔اور وہ ہر چیز پر کامل قدرت رکھتا ہے



// اللَّهُمَّ إنِّي أَسْأَلُكَ عِلْماً نَافِعاً، وَرِزقاً طَيِّباً، وَعَمَلاً مُتَقَبَّلاً

// Allaahumma 'innee 'as'aluka 'ilman naafi'an, wa rizqan tayyiban, wa 'amalan mutaqabbalan.

// اے اللہ ! بےشک میں آپ سے مانگتاہوں نفع دینے والا علم،پاکیزہ رزق اور قبولیت والا عمل



// سُبْحَانَ اللهِ وَبِحَمْدِهِ: عَدَدَ خَلْقِهِ، وَرِضَا نَفْسِهِ، وَزِنَةَ عَرْشِهِ وَمِدَادَ كَلِمَاتِهِ

// Subhaanallaahi wa bihamdihi: 'Adada khalqihi, wa ridhaa nafsihi, wa zinata 'arshihi wa midaada kalimaatihi.

// اللہ  تعالیٰ اپنی تعریف سمیت پاک ہے اپنی مخلوق کی تعداد کے برابر،اپنی ذات کی رضا کے برابر،اپنے عرش کے وزن اور اپنے کلمات کی روشنائی کے برابر






// أَسْتَغْفِرُ اللهَ وَأَتُوبُ إِلَيْهِ

// 'Astaghfirullaaha wa 'atoobu 'ilayhi.

// میں اللہ  سے بخشش مانگتاہوں اور اس کے حضور توبہ کرتاہوں



// اللَّهُمَّ صَلِّ وَسَلِّمْ عَلَى نَبِيِّنَا مُحَمَّدٍ

// Allahumma salli wa sallim alâ nabiyyinâ Muhammad.

// اے اللہ ! ہمارے نبی حضرت محمد ﷺ پر درودوسلام بھیج



// أَعُوذُ بِكَلِمَاتِ اللهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ

// 'A'oothu bikalimaatil-laahit-taammaati min sharri maa khalaqa.

// میں  اللہ  کے مکمل کلمات کی پناہ میں آتا ہوں اس کی مخلوق کے شر سے



// // ***********************************************************************************************************


// شام کی دعائیں

// الْحَمْدُ لِله وَحْدَهُ ، وَالصَّلَاةُ وَالسَلَامُ عَلَى مَنْ لَا نَبِيَّ بَعْدَهُ

// Alhamdulillahi wahdah, wassalaatu wassalaamu a'laa man la nabiyya ba'adah

// تمام تعریفیں اللہ  کے لئے ہیں جو یکتا ہے،اور درودوسلام اس پر جس کے بعد کوئی نبی نہیں

// أَعُوذُ بِاللهِ مِنَ الشَّيْطَانِ الرَّجِيمِ

// 'A 'oothu billaahi minash-Shaytaanir-rajeem

// اللهُ لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلَا يَئُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ

// Allaahu laa 'ilaaha 'illaa Huwal-Hayyul-Qayyoom, laa ta'khuthuhu sinatun wa laa nawm, lahu maa fis-samaawaati wa maa fil-'ardh, man thai-lathee yashfa'u 'indahu 'illaa bi'ithnih, ya'lamu maa bayna 'aydeehim wa maa khalfahum, wa laa yuheetoona bishay'im-min 'ilmihi 'illaa bimaa shaa'a, wasi'a kursiyyuhus samaawaati wal'ardh, wa laa ya'ooduhu hifdhuhumaa, wa Huwal- 'Aliyyul- 'Adheem.

// اللہ  وہ ذات ہے جس کے سوا کوئی سچامعبود نہیں۔وہ ذندہ جاوید ہمیشہ قائم رہنے والا ہے۔اسے اونگھ آتی ہے نہ نیند۔اسی کا ہے جو کچھ آسمانوں میں ہے اور جو کچھ ذمین میں ہے۔کون ہے وہ جو اسکے ہاں اسکی اجازت کے بغیر (کسی کی)سفارش کرسکے؟ وہ ان چیزوں کو جانتا ہے  جو ان کے سامنے ہیں اور جو انکے پیچھے ہیں۔اوروہ(لوگ)اس کے علم میں سے کسی چیز پر دسترس نہیں  رکھتے تاہم جس قدر وہ خود چاہے۔اس کی کرسی حاوی ہے ۔آسمانوں اورذمین پر اور نہیں گراں گزرتی اسے حفاظت ان دونوں کی اور وہ بلند مرتبہ ہے عظمت والا ہے

// بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ. قُلْ هُوَ اللهُ أَحَدٌ ۞ اللهُ الصَّمَدُ ۞ لَمْ يَلِدْ وَلَمْ يُولَدْ ۞ وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ

// Bismillaahir-Rahmaanir-Raheem. Qul Huwallaahu 'Ahad. Allaahus-Samad. Lam yalid wa lam yoolad. Wa lam yakun lahu kufuwan 'ahad.

// شروع کرتا ہوں اللہ  کے نام سے جو بڑا مہربان نہایت رحم والا ہے۔(آپﷺ)کہہ دیجئیے کہ وہ اللہ  ایک ہے۔ اللہ  بے نیاز ہے۔ اسکی کوئی اولاد ہے اور نہ وہ کسی کی اولاد، اور نہ ہی کوئی اس کا ہم پلہ ہے۔

// بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ.۞ قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ ۞ مِنْ شَرِّ مَا خَلَقَ ۞ وَمِنْ شَرِّ غَاسِقٍ إِذَا وَقَبَ ۞ وَمِنْ شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ ۞ وَمِنْ شَرِّ حَاسِدٍ إِذَا حَسَدَ۞

// Bismillaahir-Rahmaanir-Raheem. Qul 'a'oothu birabbil-falaq. Min sharri ma khalaq. Wa min sharri ghaasiqin 'ithaa waqab. Wa min sharrin-naffaathaati fil-'uqad. Wa min sharri haasidin 'ithaa hasad.

// شروع کرتا ہوں اللہ  کے نام سے جو بڑا مہربان نہایت رحم والا ہے۔(آپﷺ)کہہ دیجئیے کہ میں پناہ چاہتا ہوں صبح کے رب کی، اس چیز کے شر سے جو اس نے پیدا کی اور اندھیرا کرنے والے کے شر سے جب وہ چھپ جائے۔ اور گرہوں میں پھونکنے والیوں کے شر سے اور حسد کرنے والے کے شر سے جب وہ حسد کرے۔

// بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ. قُلْ أَعُوذُ بِرَبِّ النَّاسِ ۞ مَلِكِ النَّاسِ ۞ إِلَهِ النَّاسِ ۞ مِنْ شَرِّ الْوَسْوَاسِ الْخَنَّاسِ ۞ الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ ۞ مِنَ الْجِنَّةِ وَالنَّاسِ

// Bismillaahir-Rahmaanir-Raheem. Qul 'a'oothu birabbin-naas. Malikin-naas. 'Ilaahin-naas. Min sharril-waswaasil-khannaas. Allathee yuwaswisu fee sudoorin-naas. Minal-jinnati wannaas.

// شروع کرتا ہوں اللہ  کے نام سے جو بڑا مہربان نہایت رحم والا ہے۔(آپﷺ)کہہ دیجئیے کہ میں پناہ میں آتا ہوں لوگوں کے رب کی،لوگوں کے بادشاہ کی ،لوگوں کے معبود کی،وسوسہ ڈالنے والے شیطان سے جو آنکھوں سے اوجھل ہے۔ جو وسوسہ ڈالتا ہے لوگوں کے سینوں میں ۔جنوں میں سے اور انسانوں میں سے۔

// أَمْسَيْـنا وَأَمْسـى المـلكُ لله وَالحَمدُ لِله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذهِ اللَّـيْلَةِ وَخَـيرَ ما بَعْـدَهـا ، وَأَعـوذُ بِكَ مِنْ شَـرِّ هـذهِ اللَّـيْلةِ وَشَرِّ ما بَعْـدَهـا ، رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُبِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر

// 'Amsaynaa wa 'amsal-mulku lillaahi walhamdu lillaahi, laa 'ilaaha 'illallaahu wahdahu laa shareeka lahu, lahul-mulku wa lahul-hamdu wa Huwa 'alaa kulli shay'in Qadeer. Rabbi 'as'aluka khayra maa fee haathihil-laylati wa khayra maa ba'daha wa 'a'oothu bika min sharri maa fee haathihil-laylati wa sharri maa ba'daha, Rabbi 'a'oothu bika minal-kasali, wa soo'il-kibari, Rabbi 'a'oothu bika min 'athaabin fin-naari wa 'athaabin fil-qabri.

// ہم نے اور اللہ  کے ملک نے شام کی اور ہر قسم کی تعریف اللہ  ہی کے لئے ہے۔ اللہ  کے علاوہ کوئی (سچا)معبود نہیں۔وہ اکیلا ہے اس کا کوئی شریک نہیں۔اسی کی ہی بادشاہت ہے اور اسی کی ہی تعریف ہے اور وہ ہرچیز پر کامل قدرت رکھتا ہے۔اے میرے رب! میں تجھ سے اس رات کی بہتری اور اس کے بعد آنے واوالے دنوں کی بہتری کا سوال کرتا ہوں اور میں تیری پناہ میں آتا ہوں اس رات کے شر سے اور اس کے بعد آنے والے دنوں کے شر سے، اے میرے رب میں کاہلی اور بڑھاپے کی خرابی سے تیری پناہ میں آتا ہوں۔اے میرے رب! میں تیری پناہ میں آتا ہوں آگ کے عذاب سے اور قبر کے عذاب سے

// اللَّهُمَّ بِكَ أَمْسَيْنَا، وَبِكَ أَصْبَحْنَا، وَبِكَ نَحْيَا، وَبِكَ نَمُوتُ وَإِلَيْكَ المَصِیر

// Allaahumma bika 'amsaynaa, wa bika 'asbahnaa, wa bika nahyaa, wa bika namootu wa 'ilaykal-maseer.

// اللَّهُمَّ أَنْتَ رَبِّي لَا إِلَهَ إِلَّا أَنْتَ خَلَقْتَنِي وَأَنَا عَبْدُكَ وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ وَأَبُوءُ لَكَ بِذَنْبِي فَاغْفِرْ لِي فَإِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ

// Allaahumma 'Anta Rabbee laa 'ilaaha 'illaa 'Anta, khalaqtanee wa 'anaa 'abduka, wa 'anaa 'alaa 'ahdika wa wa'dika mas-tata'tu, 'a'oothu bika min sharri maa sana'tu, 'aboo'u laka bini'matika 'alayya, wa 'aboo'u bithanbee faghfir lee fa'innahu laa yaghfiruth-thunooba 'illaa 'Anta.

// اے اللہ ! تو میرارب ہے،تیرے علاوہ کوئی (سچا)معبود نہیں تو نے مجھے پیدافرمایا اور میں تیرابندہ ہوں۔اور میں اپنی طاقت کے مطابق تیرے عہد اور وعدے پر قائم ہوں۔اپنے کئے کے شر سے تیری پناہ میں آتا ہوں۔میں اپنے اوپر تیرے انعام کا اقرار کرتا ہوں اور میں اپنے گناہ کا اقرار کرتاہوں لہٰذاتو مجھے معاف کردے۔سچی بات یہ ہے کہ تیرے سوا کوئی بھی گناہ معاف نہیں کرسکتا

// اللَّهُمَّ إِنِّي أَمْسَيْتُ أُشْهِدُكَ وَأُشْهِدُ حَمَلَةَ عَرْشِكَ، وَمَلَائِكَتَكَ وَجَمِيعَ خَلْقِكَ، أَنَّكَ أَنْتَ اللهُ لَا إِلَهَ إِلَّا أَنْتَ وَحْدَكَ لَا شَرِيكَ لَكَ، وَأَنَّ مُحَمَّداً عَبْدُكَ وَرَسُولُكَ

// Allaahumma 'innee 'amsaytu 'ush-hiduka wa 'ush-hidu hamalata 'arshika, wa malaa'ikataka wajamee'a khalqika, 'annaka 'Antallaahu laa 'ilaaha 'illaa 'Anta wahdaka laa shareeka laka, wa 'anna Muhammadan 'abduka wa Rasooluka.

// اے اللہ ! یقیناََ میں نے ایسی حالت میں شام کی کہ تجھے گواہ بناتا ہوں اور تیرا عرش اٹھانے والوں اور تیرے فرشتوں اور تیری تمام مخلوق کو اس اقرار پر گواہ بناتا ہوں کہ تو ہی اللہ  ہے،تیرے سوا کوئی (سچا)معبود نہیں ۔تو اکیلا ہے،تیرا کوئی شریک نہیں۔اور بلاشبہ حضرت محمدﷺ تیرے بندے اور تیرے رسول ہیں

// صبح یا شام چار مرتبہ

// اللَّهُمَّ مَا أَمْسٰی بِي مِنْ نِعْمَةٍ أَوْ بِأَحَدٍ مِنْ خَلْقِكَ فَمِنْكَ وَحْدَكَ لَا شَرِيكَ لَكَ، فَلَكَ الْحَمْدُ وَلَكَ الشُّكْرُ

// Allaahumma maa 'amsa bee min ni'matin 'aw bi'ahadin min khalqika faminka wahdaka laa shareeka laka, falakal-hamdu wa lakash-shukru.

// اے اللہ ! شام کے وقت مجھ پر یا تیری مخلوق میں سے کسی پر جو بھی انعام ہوا ہے تو وہ تیری ہی طرف سے ہے۔تو اکیلا ہے ،تیرا کوئی شریک نہیں۔لہٰذاتیرے لئے ہی حمد ہے اور تیرے لئے ہی شکر۔

// اللَّهُمَّ عَافِنِي فِي بَدََنِي، اللَّهُمَّ عَافِنِي فِي سَمْعِي، اللَّهُمَّ عَافِنِي فِي بَصَرِي، لَا إِلَهَ إِلَّا أَنْتَ. اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكُفرِ، وَالْفَقْرِ، وَ أَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، لَا إِلَهَ إِلَّا أَنْتَ

// Allaahumma 'aafinee fee badanee, Allaahumma 'aafinee fee sam'ee, Allaahumma 'aafinee fee basaree, laa 'ilaaha 'illaa 'Anta. Allaahumma 'innee 'a'oothu bika minal-kufri, walfaqri, wa 'a'oothu bika min 'athaabil-qabri, laa 'ilaaha 'illaa 'Anta.

// اے اللہ ! مجھے عافیت دے میرے بدن میں۔اے اللہ ! مجھے عافیت دے میرے کانوں میں۔اے اللہ  مجھے عافیت دے میری آنکھوں میں۔تیرے علاوہ کوئی (سچا)معبود نہیں۔اے اللہ !یقیناََمیں تیری پناہ میں آتا ہوں عذابِ قبر سے۔تیرے علاوہ کوئی (سچا)معبود نہیں۔



// حَسْبِيَ اللهُ لَآ إِلَهَ إِلَّا هُوَ عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ

// Hasbiyallaahu laa 'ilaaha 'illaa Huwa 'alayhi tawakkaltu wa Huwa Rabbul-'Arshil-'Adheem

// مجھے اللہ  ہی کافی ہے۔ اس کے علاوہ کوئی (سچا)معبود نہیں۔اسی پر میں نے توکل کیا اور وہ عرشِ عظیم کا رب ہے



// اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ، اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي دِينِي وَدُنْيَايَ وَأَهْلِي، وَمَالِي، اللَّهُمَّ اسْتُرْ عَوْرَاتِي، وَآمِنْ رَوْعَاتِي، اللَّهُمَّ احْفَظْنِي مِنْ بَيْنِ يَدَيَّ، وَمِنْ خَلْفِي، وَعَنْ يَمِينِي، وَعَنْ شِمَالِي، وَمِنْ فَوْقِي، وَأَعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي

// Allaahumma 'innee 'as'alukal-'afwa wal'aafiyata fid-dunyaa wal'aakhirati, Allaahumma 'innee 'as'alukal-'afwa wal'aafiyata fee deenee wa dunyaaya wa 'ahlee, wa maalee , Allaahum-mastur 'awraatee, wa 'aamin raw'aatee, Allaahum-mahfadhnee min bayni yadayya, wa min khalfee, wa 'an yameenee, wa 'an shimaalee, wa min fawqee, wa 'a'oothu bi'adhamatika 'an 'ughtaala min tahtee.

// اے اللہ ! بیشک میں آپ سے دنیا و آخرت میں معافی اور عافیت کی درخواست کرتا ہوں۔ اے اللہ !بیشک میں آپ سے معافی اور عافیت کی درخواست کرتا ہوں اپنے دین اور دنیا اور اپنے اہل و مال میں۔ اے اللہ ! میری پردے والی باتوں پر پردہ ڈال اور میرے خوف وہراس کو (امن میں)بدل دے۔ اے اللہ !تو میری حفاظت فرما میرے سامنے سے، میرے پیچھے سے ، میری دائیں طرف سے اور میری بائیں طرف سے اور میرے اوپر سے ۔ اور میں تیری عظمت کی پناہ چاہتاہوں اِس بات سے کہ ناگہاں اپنے نیچے سے ہلاک کیاجاؤں

// اللَّهُمَّ عَالِمَ الْغَيْبِ وَالشَّهَادَةِ فَاطِرَ السَّماوَاتِ وَالْأَرْضِ، رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي، وَمِنْ شَرِّ الشَّيْطَانِ وَشِرْكِهِ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءاً، أَوْ أَجُرَّهُ إِلَى مُسْلِمٍ

// Allaahumma 'Aalimal-ghaybi wash-shahaadati faatiras-samaawaati wal'ardhi, Rabba kulli shay 'in wa maleekahu, 'ash-hadu 'an laa 'ilaaha 'illaa 'Anta, 'a'oothu bika min sharri nafsee, wa min sharrish-shaytaani wa shirkihi, wa 'an 'aqtarifa 'alaa nafsee soo'an, 'aw 'ajurrahu 'ilaa Muslimin.

// اے اللہ ! غیب اور حاضر کے جاننے والے ! آسمانوں اور زمین کے پیدا کرنے والے، ہر چیز کے رب اور مالک ! میں گواہی دیتا ہوں کہ تیرے سوا کوئ معبود نہیں۔ میں تیری پناہ میں آتا ہوں اپنے نفس کے شر سے ، شیطان کے شر سے ، اس کی شرک سے اور اس بات سے کہ اپنے ہی خلاف کسی برائی کا ارتکاب کروں یا اسے کسی مسلمان کی طرف کھینچ لاؤں۔

// بِسْمِ اللهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ

// Bismillaahil-lathee laa yadhurru ma'as-mihi shay'un fil-'ardhi wa laa fis-samaa'i wa Huwas-Samee 'ul- 'Aleem .

// اس اللہ  کے نام کے ساتھ جس کے نام کے ہوتے ہوئے کوئی چیز نقصان نہیں پہنچا سکتی، ذمین کی ہو یا آسمانوں کی ۔ وہ خوب سننے والا، خوب جاننے والا ہے

// رَضِيتُ باللهِ رَبَّاً، وَبِالْإِسْلَامِ دِيناً، وَبِمُحَمَّدٍ صَلَى اللهُ عَلِيهِ وَسَلَّمَ نَبِيَّاً

// Radheetu billaahi Rabban, wa bil-'Islaami deenan, wa bi-Muhammadin (sallallaahu 'alayhi wa sallama) Nabiyyan.

// میں راضی ہوا اللہ  کے رب ہونے پر، اسلام کے دین ہونے پر اور محمد ﷺ کے نبی ہونے پر



// يَا حَيُّ يَا قَيُّومُ بِرَحْمَتِكَ أَسْتَغِيثُ أَصْلِحْ لِي شَأْنِي كُلَّهُ وَلَا تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ

// Yaa Hayyu yaa Qayyoomu birahmatika 'astagheethu 'aslih lee sha'nee kullahu wa laa takilnee 'ilaa nafsee tarfata 'aynin.

// اے ذندہ جاوید! اے قائم ودائم میں تیری ہی رحمت کے ذریعے فریاد کرتا ہوں تو میرا ہر کام سنوار دے، اور مجھے آنکھ جھپکنے کے برابر بھی میرے اپنے سپرد نہ کر

// أَمْسَيْنا وَأَمْسى الْمُلْكُ للہ رَبِّ الْعَالَمِينَ، اللَّهُمَّ إِنِّي أَسْأَلُكَ  خَيْرَ  هـَذِهِ اللَّيْلَةِ  فَتْحَهَا، وَنَصْرَهَا وَنُوْرَها، وَبَرَكَتَهَا، وَهُدَاهَا، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِيْهَا وَشَرِّ مَا بَعْدَهَا

// 'Amsayna wa 'amsal-mulku lillaahi Rabbil-'aalameen, Allaahumma 'innee 'as'aluka khayra haathihil-laylati: Fathaha wa nasraha wa nooraha, wa barakataha, wa hudaaha, wa'a'oothu bika min sharri maafeeha wa sharri maa ba'daha.

// ہم نے اور اللہ  ربِ کائنات کے ملک نے شام کی۔ اے اللہ !میں آپ سے مانگتا ہوں اس رات کی بہتری،اس کی فتح ونصرت، اس کا نور اور اس کی برکت اور ہدایت۔ اور میں آپ کی پناہ چاہتا ہوں اس رات کے شر سے اور اس کے بعد والے دنوں کے شر سے

// سُبْحَانَ اللهِ وَبِحَمْدِهِ

// Subhaanallaahi wa bihamdihi.

// میں اللہ  کی تعریف کے ساتھ ساتھ اس کی پاکیزگی بیان کرتاہوں



// لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ

// Laa 'ilaaha 'illallaahu wahdahu laa shareeka lahu, lahul-mulku wa lahul-hamdu, wa Huwa 'alaa kulli shay'in Qadeer.

// اللہ  تعالیٰ کے علاوہ کوئی (سچا)معبود نہیں،وہ اکیلا ہے، اس کا کوئی شریک نہیں اسی کی بادشاہت اور اسی کی تعریف ہے۔اور وہ ہر چیز پر کامل قدرت رکھتا ہے



// أَسْتَغْفِرُ اللهَ وَأَتُوبُ إِلَيْهِ

// 'Astaghfirullaaha wa 'atoobu 'ilayhi.

// میں اللہ  سے بخشش مانگتاہوں اور اس کے حضور توبہ کرتاہوں



// أَعُوذُ بِكَلِمَاتِ اللهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ

// 'A'oothu bikalimaatil-laahit-taammaati min sharri maa khalaqa.

// میں  اللہ  کے مکمل کلمات کی پناہ میں آتا ہوں اس کی مخلوق کے شر سے



// اللَّهُمَّ صَلِّ وَسَلِّمْ عَلَى نَبِيِّنَا مُحَمَّدٍ

// Allahumma salli wa sallim alâ nabiyyinâ Muhammad.
